"""
计算方法
利用Appium-Inspector点击相应的元素位置，通过bounds计算中间值
bounds [x1,y1][x2,y2]
[0]: (x1+x2) / 2
[1]: (y1+y2) / 2
"""

# app body的分辨率
resolution = [1080,2150]

##################################### 界面按钮 #####################################

# 主页搜索框元素
home_search_button = [803,142]
# 点击搜索框后的搜索框元素
job_search_button = [981,143]
# 顶栏返回按钮元素
back_button = [91,143]

##################################### 界面按钮 #####################################


##################################### 职位选择按钮 #####################################

#### 综合排序-排序按钮 ####
order_button = [287,391]
## 按最新排序按钮 ##
order_button_latest = [143,1758]
##
## 关闭x元素 ##
order_button_close = [991,1456]
####################

### 新用户-浮板 ###
close_button = [799,669]
####################

### 页面详情 ###
######### 例外计算方法，中间底部 #########
first_card = [540,999]
#######################

#### 详情页面-分享按钮-文件加一个箭头的图标 ####
share_button = [882,152]
## 打开后的复制链接 ##
share_button_link = [863,1832]
### 页面详情 ###

##################################### 职位选择按钮 #####################################